Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:enumerator:`LV_EVENT_RENDER_READY`: Sent after rendering has been completed (before calling :ref:`flush_callback`)
it_it: :cpp:enumerator:`LV_EVENT_RENDER_READY`: Inviato dopo il completamento del rendering (prima di chiamare :ref:`flush_callback`)

source: :cpp:enumerator:`LV_EVENT_RENDER_START`: Sent just before rendering begins.
it_it: :cpp:enumerator:`LV_EVENT_RENDER_START`: Inviato appena prima dell'inizio del rendering.

source: :cpp:enumerator:`LV_EVENT_RESOLUTION_CHANGED`: Sent when the resolution changes due to :cpp:func:`lv_display_set_resolution` or :cpp:func:`lv_display_set_rotation`.
it_it: :cpp:enumerator:`LV_EVENT_RESOLUTION_CHANGED`: Inviato quando la risoluzione cambia a causa di :cpp:func:`lv_display_set_resolution` o di :cpp:func:`lv_display_set_rotation`.

source: :cpp:enumerator:`LV_EVENT_SCREEN_LOADED`: A screen was loaded
it_it: :cpp:enumerator:`LV_EVENT_SCREEN_LOADED`: È stata caricata una schermata.

source: :cpp:enumerator:`LV_EVENT_SCREEN_LOAD_START`: A screen load started, fired when the screen change delay is expired
it_it: :cpp:enumerator:`LV_EVENT_SCREEN_LOAD_START`: È stato avviato il caricamento di una schermata, attivato allo scadere del ritardo per il cambio schermata.

source: :cpp:enumerator:`LV_EVENT_SCREEN_UNLOADED`: A screen was unloaded
it_it: :cpp:enumerator:`LV_EVENT_SCREEN_UNLOADED`: È stata dismessa una schermata

source: :cpp:enumerator:`LV_EVENT_SCREEN_UNLOAD_START`: A screen unload started, fired immediately when scr_load is called
it_it: :cpp:enumerator:`LV_EVENT_SCREEN_UNLOAD_START`: È stato avviata la dismissione di una schermata, attivata immediatamente alla chiamata di scr_load.

source: :cpp:enumerator:`LV_EVENT_SCROLL_BEGIN`: Scrolling begins.
it_it: :cpp:enumerator:`LV_EVENT_SCROLL_BEGIN`: Inizia lo Scrolling.

source: :cpp:enumerator:`LV_EVENT_SCROLL_BEGIN`: Signals that scrolling has begun.
it_it: :cpp:enumerator:`LV_EVENT_SCROLL_BEGIN`: Segnala l'inizio dello scrolling.

source: :cpp:enumerator:`LV_EVENT_SCROLL_END`: Scrolling ends
it_it: :cpp:enumerator:`LV_EVENT_SCROLL_END`: Termina lo "scrolling"

source: :cpp:enumerator:`LV_EVENT_SCROLL_END`: Signals that scrolling has ended.
it_it: :cpp:enumerator:`LV_EVENT_SCROLL_END`: Segnala la fine dello scrolling.

source: :cpp:enumerator:`LV_EVENT_SCROLL`: Signals that the scrolling position changed; triggered on every position change.
it_it: :cpp:enumerator:`LV_EVENT_SCROLL`: Segnala la modifica della posizione di scorrimento; attivato a ogni cambio di posizione.

source: :cpp:enumerator:`LV_EVENT_SHORT_CLICKED`: Widget was pressed for a short period of time, and then released without scrolling.
it_it: :cpp:enumerator:`LV_EVENT_SHORT_CLICKED`: Il Widget è stato premuto per un breve periodo di tempo e poi rilasciato senza scorrere.

source: :cpp:enumerator:`LV_EVENT_SINGLE_CLICKED`: Widget was pressed for a short period of time, and then released without scrolling, for the first time in a click streak.
it_it: :cpp:enumerator:`LV_EVENT_SINGLE_CLICKED`: Il Widget è stato premuto per un breve periodo di tempo e poi rilasciato senza scorrere, per la prima volta in una serie di clic.

source: :cpp:enumerator:`LV_EVENT_SIZE_CHANGED`: Widget coordinates/size have changed
it_it: :cpp:enumerator:`LV_EVENT_SIZE_CHANGED`: Le coordinate/dimensioni del Widget sono cambiate

source: :cpp:enumerator:`LV_EVENT_STATE_CHANGED`: The state of a widget has been changed.
it_it: :cpp:enumerator:`LV_EVENT_STATE_CHANGED`: Lo stato di un widget è stato modificato.

source: :cpp:enumerator:`LV_EVENT_STYLE_CHANGED`: Widget's style has changed
it_it: :cpp:enumerator:`LV_EVENT_STYLE_CHANGED`: Lo stile del Widget è cambiato

source: :cpp:enumerator:`LV_EVENT_TRIPLE_CLICKED`: Widget was pressed for a short period of time, and then released without scrolling, for the third time in a click streak.
it_it: :cpp:enumerator:`LV_EVENT_TRIPLE_CLICKED`: Il Widget è stato premuto per un breve periodo di tempo e poi rilasciato senza scorrere, per la terza volta in una serie di clic.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent after a new tile is displayed by scrolling.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato dopo la visualizzazione di un nuovo tile tramite scorrimento.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent if a date is clicked.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato se si clicca su una data.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent once when any item (file) in the ``Browser Panel``\ 's file list is clicked.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato una volta quando si clicca su un elemento (file) nell'elenco dei file del ``Pannello Browser``.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when Checkbox is toggled.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando la Checkbox viene attivata/disattivata.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when Image Button's CHECKED state is toggled.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando lo stato CHECKED dell'Image Button viene attivato/disattivato.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when Switch changes state.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando lo Switch cambia stato.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a Page is shown.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando viene visualizzata una Page.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a new cell is selected with keys.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando una nuova cella viene selezionata con i tasti.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a new list item is selected.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando viene selezionato un nuovo elemento dell'elenco.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a new option is selected or the list is opened/closed.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando viene selezionata una nuova opzione o l'elenco viene aperto/chiuso.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a new point on the chart is pressed.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando viene premuto un nuovo punto sul grafico.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when a new tab is selected by sliding or clicking the tab button.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando si seleziona una nuova scheda facendo scorrere o cliccando sul pulsante della scheda.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when the button is pressed/released or repeated after long press.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando il pulsante viene premuto/rilasciato o ripetuto dopo una pressione prolungata.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when the content of the Text Area has changed.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando il contenuto della Text Area è cambiato.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent when value has changed.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato quando il valore è cambiato.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Sent while the Slider is being dragged or changed with keys.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` Inviato mentre lo Slider viene trascinato o modificato con i tasti.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` sent when Arc is pressed/dragged to a new value.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` viene inviato quando l'Arco viene premuto/trascinato su un nuovo valore.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` when the :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` flag is enabled and the Widget is clicked.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` quando il flag :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` è abilitato e si clicca sul Widget.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED`: Sent when a button is pressed/released or repeated after long press.
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED`: Inviato quando un pulsante viene premuto/rilasciato o ripetuto dopo una pressione prolungata.

source: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED`: Widget's value has changed (i.e. slider moved)
it_it: :cpp:enumerator:`LV_EVENT_VALUE_CHANGED`: Il valore del Widget è cambiato (ad esempio, il cursore è stato spostato)

source: :cpp:enumerator:`LV_EXPLORER_SORT_NONE` (default)
it_it: :cpp:enumerator:`LV_EXPLORER_SORT_NONE` (il default)

source: :cpp:enumerator:`LV_FLEX_ALIGN_CENTER`: simply center with respect to direction
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_CENTER`: semplicemente centra rispetto alla direzione

source: :cpp:enumerator:`LV_FLEX_ALIGN_END`: means right when direction is horizontal, bottom when vertical
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_END`: indica destra quando la direzione è orizzontale, in basso quando è verticale

source: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_AROUND`: items are evenly distributed in the track with equal space around them.
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_AROUND`: gli elementi sono distribuiti uniformemente nella track con uguale spazio attorno a loro.

source: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_BETWEEN`: items are evenly distributed in the track with no space before and after first and last items.
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_BETWEEN`: gli elementi sono distribuiti uniformemente nella traccia senza spazio prima e dopo il primo e l'ultimo elemento.

source: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_EVENLY`: items are distributed so that the spacing between any two items (and the space to the edges) is equal.
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_SPACE_EVENLY`: gli elementi vengono distribuiti in modo che la spaziatura tra due elementi qualsiasi (e lo spazio tra i bordi) sia uguale.

source: :cpp:enumerator:`LV_FLEX_ALIGN_START`: means left when direction is horizontal, top when vertical (default)
it_it: :cpp:enumerator:`LV_FLEX_ALIGN_START`: indica sinistra quando la direzione è orizzontale, in alto quando è verticale (il default)

source: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_REVERSE`: Place the children in a column without wrapping but in reversed order
it_it: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_REVERSE`: Posiziona gli elementi figlio in una colonna senza riavvolgimento ma in ordine inverso

source: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_WRAP_REVERSE`: Place the children in a column with wrapping but in reversed order
it_it: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_WRAP_REVERSE`: Posiziona gli elementi figlio in una colonna con riavvolgimento ma in ordine inverso

source: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_WRAP`: Place the children in a column with wrapping
it_it: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN_WRAP`: Posiziona gli elementi figlio in una colonna con riavvolgimento

source: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN`: Place the children in a column without wrapping
it_it: :cpp:enumerator:`LV_FLEX_FLOW_COLUMN`: Posiziona gli elementi figlio in una colonna senza riavvolgimento

source: :cpp:enumerator:`LV_FLEX_FLOW_ROW_REVERSE`: Place the children in a row without wrapping but in reversed order
it_it: :cpp:enumerator:`LV_FLEX_FLOW_ROW_REVERSE`: Posiziona gli elementi figlio in una riga senza riavvolgimento ma in ordine inverso

source: :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP_REVERSE`: Place the children in a row with wrapping but in reversed order
it_it: :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP_REVERSE`: Posiziona gli elementi figlio in una riga con riavvolgimento ma in ordine inverso

source: :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP`: Place the children in a row with wrapping
it_it: :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP`: Posiziona gli elementi figlio in una riga con riavvolgimento

source: :cpp:enumerator:`LV_FLEX_FLOW_ROW`: Place the children in a row without wrapping
it_it: :cpp:enumerator:`LV_FLEX_FLOW_ROW`: Posiziona gli elementi figlio in una riga senza riavvolgimento

source: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_BOLD`: Bold style.
it_it: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_BOLD`: Stile grassetto.

source: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_ITALIC`: Italic style.
it_it: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_ITALIC`: Stile corsivo.

source: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_NORMAL`: Default style.
it_it: :cpp:enumerator:`LV_FREETYPE_FONT_STYLE_NORMAL`: Stile di default.

source: :cpp:enumerator:`LV_GRAD_EXTEND_PAD`: Repeat the same color
it_it: :cpp:enumerator:`LV_GRAD_EXTEND_PAD`: Ripete lo stesso colore

source: :cpp:enumerator:`LV_GRAD_EXTEND_REFLECT`: Repeat the pattern normally and mirrored alternately
it_it: :cpp:enumerator:`LV_GRAD_EXTEND_REFLECT`: Ripete il pattern normale e speculare alternativamente

source: :cpp:enumerator:`LV_GRAD_EXTEND_REPEAT`: Repeat the pattern
it_it: :cpp:enumerator:`LV_GRAD_EXTEND_REPEAT`: Ripete il pattern

source: :cpp:enumerator:`LV_GRIDNAV_CTRL_HORIZONTAL_MOVE_ONLY`: Only use the left/right keys for grid navigation.
it_it: :cpp:enumerator:`LV_GRIDNAV_CTRL_HORIZONTAL_MOVE_ONLY`: Utilizza solo i tasti sinistro/destro per la navigazione nella griglia.

source: :cpp:enumerator:`LV_GRIDNAV_CTRL_NONE`: Default settings
it_it: :cpp:enumerator:`LV_GRIDNAV_CTRL_NONE`: Impostazioni di default

source: :cpp:enumerator:`LV_GRIDNAV_CTRL_ROLLOVER`: If there is no next/previous Widget in a direction, the focus goes to the Widget in the next/previous row (on left/right keys) or first/last row (on up/down keys)
it_it: :cpp:enumerator:`LV_GRIDNAV_CTRL_ROLLOVER`: Se non è presente alcun Widget successivo/precedente in una direzione, il focus passa al Widget nella riga successiva/precedente (con i tasti sinistra/destra) o nella prima/ultima riga (con i tasti su/giù)

source: :cpp:enumerator:`LV_GRIDNAV_CTRL_SCROLL_FIRST`: If an arrow is pressed and the focused Widget can be scrolled in that direction then it will be scrolled instead of going to the next/previous Widget.
it_it: :cpp:enumerator:`LV_GRIDNAV_CTRL_SCROLL_FIRST`: Se si preme una freccia e il Widget col focus può essere fatto scorrere in quella direzione, verrà fatto scorrere invece di passare al Widget successivo/precedente.

source: :cpp:enumerator:`LV_GRIDNAV_CTRL_VERTICAL_MOVE_ONLY`: Only use the up/down keys for grid navigation.
it_it: :cpp:enumerator:`LV_GRIDNAV_CTRL_VERTICAL_MOVE_ONLY`: Utilizza solo i tasti su/giù per la "grid navigation".

source: :cpp:enumerator:`LV_GRID_ALIGN_CENTER`: simply center
it_it: :cpp:enumerator:`LV_GRID_ALIGN_CENTER`: semplicemente centra

source: :cpp:enumerator:`LV_GRID_ALIGN_CENTER`: simply center ``column_pos`` and ``row_pos`` means the zero-based index of the cell in which the item should be placed.
it_it: :cpp:enumerator:`LV_GRID_ALIGN_CENTER`: semplicemente centra ``column_pos`` e ``row_pos``, indica l'indice a partire da zero della cella in cui deve essere posizionato l'elemento.

source: :cpp:enumerator:`LV_GRID_ALIGN_END`: means right when direction is horizontal and bottom when vertical
it_it: :cpp:enumerator:`LV_GRID_ALIGN_END`: indica a destra quando la direzione è orizzontale e in basso quando è verticale.

source: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_AROUND`: items are evenly distributed in the track with equal space around them.
it_it: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_AROUND`: gli elementi sono distribuiti uniformemente nella track con lo stesso spazio intorno a loro.

source: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_BETWEEN`: items are evenly distributed in the track with first and last items next to container's edges.
it_it: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_BETWEEN`: gli elementi sono distribuiti uniformemente nella track con il primo e l'ultimo elemento adiacenti ai bordi del contenitore.

source: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_EVENLY`: items are distributed so that the spacing between any two items (and the space to the edges) is equal.
it_it: :cpp:enumerator:`LV_GRID_ALIGN_SPACE_EVENLY`: gli elementi sono distribuiti in modo che la spaziatura tra due elementi qualsiasi (e lo spazio fino ai bordi) sia uguale.

source: :cpp:enumerator:`LV_GRID_ALIGN_START`: means left when direction is horizontal and top when vertical (default)
it_it: :cpp:enumerator:`LV_GRID_ALIGN_START`: indica a sinistra quando la direzione è orizzontale e in alto quando è verticale (il default)

source: :cpp:enumerator:`LV_GRID_ALIGN_START`: means left when direction is horizontal and top when vertical.
it_it: :cpp:enumerator:`LV_GRID_ALIGN_START`: indica sinistra quando la direzione è orizzontale e in alto quando è verticale.

source: :cpp:enumerator:`LV_IMAGE_ALIGN_CONTAIN` The image keeps its aspect ratio, but is resized to the maximum size that fits within the Widget's area.
it_it: :cpp:enumerator:`LV_IMAGE_ALIGN_CONTAIN` L'immagine mantiene le sue proporzioni, ma viene ridimensionata alla dimensione massima che rientra nell'area del Widget.

source: :cpp:enumerator:`LV_IMAGE_ALIGN_COVER` The image keeps its aspect ratio and fills the Widget's area.
it_it: :cpp:enumerator:`LV_IMAGE_ALIGN_COVER` L'immagine mantiene le sue proporzioni e riempie l'area del Widget.

source: :cpp:enumerator:`LV_IMAGE_ALIGN_DEFAULT`: Meaning top left
it_it: :cpp:enumerator:`LV_IMAGE_ALIGN_DEFAULT`: Significa in alto a sinistra

source: :cpp:enumerator:`LV_IMAGE_ALIGN_STRETCH` Set X and Y scale to fill the Widget's area
it_it: :cpp:enumerator:`LV_IMAGE_ALIGN_STRETCH` Imposta la scala X e Y per riempire l'area del Widget.

source: :cpp:enumerator:`LV_IMAGE_ALIGN_TILE` Tile image to fill Widget's area.
it_it: :cpp:enumerator:`LV_IMAGE_ALIGN_TILE` Affianca l'immagine per riempire l'area del Widget.

source: :cpp:enumerator:`LV_IME_PINYIN_MODE_K26`: Pinyin 26-key input mode
it_it: :cpp:enumerator:`LV_IME_PINYIN_MODE_K26`: Modalità di input Pinyin a 26 tasti

source: :cpp:enumerator:`LV_IME_PINYIN_MODE_K9_NUMBER`: Numeric keypad mode
it_it: :cpp:enumerator:`LV_IME_PINYIN_MODE_K9_NUMBER`: Modalità tastierino numerico

source: :cpp:enumerator:`LV_IME_PINYIN_MODE_K9`: Pinyin 9-key input mode
it_it: :cpp:enumerator:`LV_IME_PINYIN_MODE_K9`: Modalità di input Pinyin a 9 tasti

source: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_ENDED`: The gesture ended.
it_it: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_ENDED`: Il gesto è terminato.

source: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_NONE`: The gesture is not active.
it_it: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_NONE`: Il gesto non è attivo.

source: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_RECOGNIZED`: The gesture is recognized and can be used.
it_it: :cpp:enumerator:`LV_INDEV_GESTURE_STATE_RECOGNIZED`: Il gesto è riconosciuto e può essere utilizzato.

source: :cpp:enumerator:`LV_INDEV_TYPE_BUTTON`: The minimum and maximum values of ``btn_id``.
it_it: :cpp:enumerator:`LV_INDEV_TYPE_BUTTON`: I valori minimo e massimo di ``btn_id``.

source: :cpp:enumerator:`LV_INDEV_TYPE_BUTTON`: external buttons virtually pressing the screen
it_it: :cpp:enumerator:`LV_INDEV_TYPE_BUTTON`: pulsanti esterni che premono virtualmente lo schermo

source: :cpp:enumerator:`LV_INDEV_TYPE_ENCODER`: The minimum and maximum values of ``enc_diff``.
it_it: :cpp:enumerator:`LV_INDEV_TYPE_ENCODER`: I valori minimo e massimo di ``enc_diff``.

source: :cpp:enumerator:`LV_INDEV_TYPE_ENCODER`: encoder with left/right turn and push options
it_it: :cpp:enumerator:`LV_INDEV_TYPE_ENCODER`: encoder con opzioni di rotazione a sinistra/destra e di pressione

source: :cpp:enumerator:`LV_INDEV_TYPE_KEYPAD`: No effect, Send random :ref:`indev_keys`.
it_it: :cpp:enumerator:`LV_INDEV_TYPE_KEYPAD`: Nessun effetto, invia :ref:`indev_keys` casuali.

source: :cpp:enumerator:`LV_INDEV_TYPE_KEYPAD`: keyboard or keypad
it_it: :cpp:enumerator:`LV_INDEV_TYPE_KEYPAD`: tastiera o tastierino numerico

source: :cpp:enumerator:`LV_INDEV_TYPE_POINTER`: No effect, click randomly within the pixels of the screen resolution.
it_it: :cpp:enumerator:`LV_INDEV_TYPE_POINTER`: Nessun effetto, clic casuale entro i pixel della risoluzione dello schermo.

source: :cpp:enumerator:`LV_INDEV_TYPE_POINTER`: touchpad or mouse
it_it: :cpp:enumerator:`LV_INDEV_TYPE_POINTER`: touchpad o mouse

source: :cpp:enumerator:`LV_KEYBOARD_MODE_NUMBER` Display numbers, +/- sign, and decimal dot
it_it: :cpp:enumerator:`LV_KEYBOARD_MODE_NUMBER` Visualizza numeri, segno +/- e punto decimale

source: :cpp:enumerator:`LV_KEYBOARD_MODE_SPECIAL` Display special characters
it_it: :cpp:enumerator:`LV_KEYBOARD_MODE_SPECIAL` Visualizza caratteri speciali

source: :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_LOWER` Display lower case letters
it_it: :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_LOWER` Visualizza lettere minuscole

source: :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_UPPER` Display upper case letters
it_it: :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_UPPER` Visualizza lettere maiuscole

source: :cpp:enumerator:`LV_KEYBOARD_MODE_USER_1` through :cpp:enumerator:`LV_KEYBOARD_MODE_USER_4` User-defined modes.
it_it: Da :cpp:enumerator:`LV_KEYBOARD_MODE_USER_1` a :cpp:enumerator:`LV_KEYBOARD_MODE_USER_4` Modalità definite dall'utente.

source: :cpp:enumerator:`LV_KEY_BACKSPACE`: Delete (e.g., a character on the left in a :ref:`Text Area <lv_textarea>`)
it_it: :cpp:enumerator:`LV_KEY_BACKSPACE`: Elimina (ad esempio, un carattere a sinistra in una :ref:`Text Area <lv_textarea>`)

source: :cpp:enumerator:`LV_KEY_DEL`: Delete (e.g., a character on the right in a :ref:`Text Area <lv_textarea>`)
it_it: :cpp:enumerator:`LV_KEY_DEL`: Elimina (ad esempio, un carattere a destra in una :ref:`Text Area <lv_textarea>`)

source: :cpp:enumerator:`LV_KEY_DOWN`: Decrease value or move down
it_it: :cpp:enumerator:`LV_KEY_DOWN`: Diminuisce il valore o sposta verso il basso

source: :cpp:enumerator:`LV_KEY_END`: Go to the end (e.g., in a :ref:`Text Area <lv_textarea>`)
it_it: :cpp:enumerator:`LV_KEY_END`: Vai alla fine (ad esempio, in una :ref:`Text Area <lv_textarea>`)

source: :cpp:enumerator:`LV_KEY_ENTER` Apply selected list item (sends :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` event and closes Drop-Down List).
it_it: :cpp:enumerator:`LV_KEY_ENTER` Applica l'elemento dell'elenco selezionato (invia l'evento :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` e chiude la Drop-Down List).

source: :cpp:enumerator:`LV_KEY_ENTER` Clicks the Checkbox and toggles its value.
it_it: :cpp:enumerator:`LV_KEY_ENTER` Clicca sulla Checkbox e ne cambia il valore.

source: :cpp:enumerator:`LV_KEY_ENTER` Clicks the Image Button
it_it: :cpp:enumerator:`LV_KEY_ENTER` Clicca sull'Image Button

source: :cpp:enumerator:`LV_KEY_ENTER` To press/release the selected button
it_it: :cpp:enumerator:`LV_KEY_ENTER` Per premere/rilasciare il pulsante selezionato

source: :cpp:enumerator:`LV_KEY_ENTER` To press/release the selected button.
it_it: :cpp:enumerator:`LV_KEY_ENTER` Per premere/rilasciare il pulsante selezionato.

source: :cpp:enumerator:`LV_KEY_ENTER` To press/release the selected date
it_it: :cpp:enumerator:`LV_KEY_ENTER` Per premere/rilasciare la data selezionata

source: :cpp:enumerator:`LV_KEY_ENTER` Toggles the Switch
it_it: :cpp:enumerator:`LV_KEY_ENTER` Attiva/disattiva lo Switch

source: :cpp:enumerator:`LV_KEY_ENTER` With *Encoder*, move focus to next digit.
it_it: :cpp:enumerator:`LV_KEY_ENTER` con l'*Encoder*, sposta il focus sulla cifra successiva.

source: :cpp:enumerator:`LV_KEY_ENTER`: Triggers :cpp:enumerator:`LV_EVENT_PRESSED`, :cpp:enumerator:`LV_EVENT_CLICKED`, or :cpp:enumerator:`LV_EVENT_LONG_PRESSED` events
it_it: :cpp:enumerator:`LV_KEY_ENTER`: Attiva gli eventi :cpp:enumerator:`LV_EVENT_PRESSED`, :cpp:enumerator:`LV_EVENT_CLICKED` o :cpp:enumerator:`LV_EVENT_LONG_PRESSED`

source: :cpp:enumerator:`LV_KEY_ENTER`: simulates pressing the encoder button.
it_it: :cpp:enumerator:`LV_KEY_ENTER`: simula la pressione del pulsante dell'encoder.
